# Test script to read UHDM file in Yosys
plugin -i ../../build/uhdm2rtlil.so
read_uhdm slpp_all/surelog.uhdm
# Write RTLIL immediately after reading, before hierarchy
write_rtlil lut_map_not_from_uhdm_nohier.il
hierarchy -check -top lut_map_not
stat
proc
opt
stat
write_rtlil lut_map_not_from_uhdm.il
# Synthesize to gate-level netlist
synth -top lut_map_not
write_verilog -noexpr lut_map_not_from_uhdm_synth.v
