# Test script to read UHDM file in Yosys
plugin -i ../../build/uhdm2rtlil.so
read_uhdm slpp_all/surelog.uhdm
# Write RTLIL immediately after reading, before hierarchy
write_rtlil custom_map_incomp_from_uhdm_nohier.il
hierarchy -check -top custom_map_incomp
stat
proc
opt
stat
write_rtlil custom_map_incomp_from_uhdm.il
# Synthesize to gate-level netlist
synth -top custom_map_incomp
write_verilog -noexpr custom_map_incomp_from_uhdm_synth.v
