read_verilog -lib +/simcells.v
read_verilog -sv /home/alain/uhdm2rtlil/test/asicworld_clk_div_45/asicworld_clk_div_45_from_verilog_synth.v
hierarchy -auto-top
proc
flatten
opt -purge
chtype -map \$_AND_ $_AND_
chtype -map \$_NAND_ $_NAND_
chtype -map \$_OR_ $_OR_
chtype -map \$_NOR_ $_NOR_
chtype -map \$_XOR_ $_XOR_
chtype -map \$_XNOR_ $_XNOR_
chtype -map \$_NOT_ $_NOT_
chtype -map \$_ANDNOT_ $_ANDNOT_
chtype -map \$_ORNOT_ $_ORNOT_
chtype -map \$_MUX_ $_MUX_
chtype -map \$_NMUX_ $_NMUX_
chtype -map \$_DFF_P_ $_DFF_P_
chtype -map \$_DFF_N_ $_DFF_N_
chtype -map \$_DFF_PP0_ $_DFF_PP0_
chtype -map \$_DFF_PP1_ $_DFF_PP1_
chtype -map \$_DFF_PN0_ $_DFF_PN0_
chtype -map \$_DFF_PN1_ $_DFF_PN1_
chtype -map \$_DFF_NP0_ $_DFF_NP0_
chtype -map \$_DFF_NP1_ $_DFF_NP1_
chtype -map \$_DFF_NN0_ $_DFF_NN0_
chtype -map \$_DFF_NN1_ $_DFF_NN1_
chtype -map \$_DFFE_PP_ $_DFFE_PP_
chtype -map \$_DFFE_PN_ $_DFFE_PN_
chtype -map \$_DFFE_NP_ $_DFFE_NP_
chtype -map \$_DFFE_NN_ $_DFFE_NN_
chtype -map \$_SDFF_PP0_ $_SDFF_PP0_
chtype -map \$_SDFF_PP1_ $_SDFF_PP1_
chtype -map \$_SDFF_PN0_ $_SDFF_PN0_
chtype -map \$_SDFF_PN1_ $_SDFF_PN1_
chtype -map \$_SDFF_NP0_ $_SDFF_NP0_
chtype -map \$_SDFF_NP1_ $_SDFF_NP1_
chtype -map \$_SDFF_NN0_ $_SDFF_NN0_
chtype -map \$_SDFF_NN1_ $_SDFF_NN1_
chtype -map \$_SDFFE_PP0P_ $_SDFFE_PP0P_
chtype -map \$_SDFFE_PP0N_ $_SDFFE_PP0N_
chtype -map \$_SDFFE_PP1P_ $_SDFFE_PP1P_
chtype -map \$_SDFFE_PP1N_ $_SDFFE_PP1N_
chtype -map \$_SDFFE_PN0P_ $_SDFFE_PN0P_
chtype -map \$_SDFFE_PN0N_ $_SDFFE_PN0N_
chtype -map \$_SDFFE_PN1P_ $_SDFFE_PN1P_
chtype -map \$_SDFFE_PN1N_ $_SDFFE_PN1N_
chtype -map \$_SDFFE_NP0P_ $_SDFFE_NP0P_
chtype -map \$_SDFFE_NP0N_ $_SDFFE_NP0N_
chtype -map \$_SDFFE_NP1P_ $_SDFFE_NP1P_
chtype -map \$_SDFFE_NP1N_ $_SDFFE_NP1N_
chtype -map \$_SDFFE_NN0P_ $_SDFFE_NN0P_
chtype -map \$_SDFFE_NN0N_ $_SDFFE_NN0N_
chtype -map \$_SDFFE_NN1P_ $_SDFFE_NN1P_
chtype -map \$_SDFFE_NN1N_ $_SDFFE_NN1N_
chtype -map \$_SDFFCE_PP0P_ $_SDFFCE_PP0P_
chtype -map \$_SDFFCE_PP0N_ $_SDFFCE_PP0N_
chtype -map \$_SDFFCE_PP1P_ $_SDFFCE_PP1P_
chtype -map \$_SDFFCE_PP1N_ $_SDFFCE_PP1N_
chtype -map \$_SDFFCE_PN0P_ $_SDFFCE_PN0P_
chtype -map \$_SDFFCE_PN0N_ $_SDFFCE_PN0N_
chtype -map \$_SDFFCE_PN1P_ $_SDFFCE_PN1P_
chtype -map \$_SDFFCE_PN1N_ $_SDFFCE_PN1N_
chtype -map \$_SDFFCE_NP0P_ $_SDFFCE_NP0P_
chtype -map \$_SDFFCE_NP0N_ $_SDFFCE_NP0N_
chtype -map \$_SDFFCE_NP1P_ $_SDFFCE_NP1P_
chtype -map \$_SDFFCE_NP1N_ $_SDFFCE_NP1N_
chtype -map \$_SDFFCE_NN0P_ $_SDFFCE_NN0P_
chtype -map \$_SDFFCE_NN0N_ $_SDFFCE_NN0N_
chtype -map \$_SDFFCE_NN1P_ $_SDFFCE_NN1P_
chtype -map \$_SDFFCE_NN1N_ $_SDFFCE_NN1N_
rename -top gold
design -stash gold

design -reset
read_verilog -lib +/simcells.v
read_verilog -sv /home/alain/uhdm2rtlil/test/asicworld_clk_div_45/asicworld_clk_div_45_from_uhdm_synth.v
hierarchy -auto-top
proc
flatten
opt -purge
chtype -map \$_AND_ $_AND_
chtype -map \$_NAND_ $_NAND_
chtype -map \$_OR_ $_OR_
chtype -map \$_NOR_ $_NOR_
chtype -map \$_XOR_ $_XOR_
chtype -map \$_XNOR_ $_XNOR_
chtype -map \$_NOT_ $_NOT_
chtype -map \$_ANDNOT_ $_ANDNOT_
chtype -map \$_ORNOT_ $_ORNOT_
chtype -map \$_MUX_ $_MUX_
chtype -map \$_NMUX_ $_NMUX_
chtype -map \$_DFF_P_ $_DFF_P_
chtype -map \$_DFF_N_ $_DFF_N_
chtype -map \$_DFF_PP0_ $_DFF_PP0_
chtype -map \$_DFF_PP1_ $_DFF_PP1_
chtype -map \$_DFF_PN0_ $_DFF_PN0_
chtype -map \$_DFF_PN1_ $_DFF_PN1_
chtype -map \$_DFF_NP0_ $_DFF_NP0_
chtype -map \$_DFF_NP1_ $_DFF_NP1_
chtype -map \$_DFF_NN0_ $_DFF_NN0_
chtype -map \$_DFF_NN1_ $_DFF_NN1_
chtype -map \$_DFFE_PP_ $_DFFE_PP_
chtype -map \$_DFFE_PN_ $_DFFE_PN_
chtype -map \$_DFFE_NP_ $_DFFE_NP_
chtype -map \$_DFFE_NN_ $_DFFE_NN_
chtype -map \$_SDFF_PP0_ $_SDFF_PP0_
chtype -map \$_SDFF_PP1_ $_SDFF_PP1_
chtype -map \$_SDFF_PN0_ $_SDFF_PN0_
chtype -map \$_SDFF_PN1_ $_SDFF_PN1_
chtype -map \$_SDFF_NP0_ $_SDFF_NP0_
chtype -map \$_SDFF_NP1_ $_SDFF_NP1_
chtype -map \$_SDFF_NN0_ $_SDFF_NN0_
chtype -map \$_SDFF_NN1_ $_SDFF_NN1_
chtype -map \$_SDFFE_PP0P_ $_SDFFE_PP0P_
chtype -map \$_SDFFE_PP0N_ $_SDFFE_PP0N_
chtype -map \$_SDFFE_PP1P_ $_SDFFE_PP1P_
chtype -map \$_SDFFE_PP1N_ $_SDFFE_PP1N_
chtype -map \$_SDFFE_PN0P_ $_SDFFE_PN0P_
chtype -map \$_SDFFE_PN0N_ $_SDFFE_PN0N_
chtype -map \$_SDFFE_PN1P_ $_SDFFE_PN1P_
chtype -map \$_SDFFE_PN1N_ $_SDFFE_PN1N_
chtype -map \$_SDFFE_NP0P_ $_SDFFE_NP0P_
chtype -map \$_SDFFE_NP0N_ $_SDFFE_NP0N_
chtype -map \$_SDFFE_NP1P_ $_SDFFE_NP1P_
chtype -map \$_SDFFE_NP1N_ $_SDFFE_NP1N_
chtype -map \$_SDFFE_NN0P_ $_SDFFE_NN0P_
chtype -map \$_SDFFE_NN0N_ $_SDFFE_NN0N_
chtype -map \$_SDFFE_NN1P_ $_SDFFE_NN1P_
chtype -map \$_SDFFE_NN1N_ $_SDFFE_NN1N_
chtype -map \$_SDFFCE_PP0P_ $_SDFFCE_PP0P_
chtype -map \$_SDFFCE_PP0N_ $_SDFFCE_PP0N_
chtype -map \$_SDFFCE_PP1P_ $_SDFFCE_PP1P_
chtype -map \$_SDFFCE_PP1N_ $_SDFFCE_PP1N_
chtype -map \$_SDFFCE_PN0P_ $_SDFFCE_PN0P_
chtype -map \$_SDFFCE_PN0N_ $_SDFFCE_PN0N_
chtype -map \$_SDFFCE_PN1P_ $_SDFFCE_PN1P_
chtype -map \$_SDFFCE_PN1N_ $_SDFFCE_PN1N_
chtype -map \$_SDFFCE_NP0P_ $_SDFFCE_NP0P_
chtype -map \$_SDFFCE_NP0N_ $_SDFFCE_NP0N_
chtype -map \$_SDFFCE_NP1P_ $_SDFFCE_NP1P_
chtype -map \$_SDFFCE_NP1N_ $_SDFFCE_NP1N_
chtype -map \$_SDFFCE_NN0P_ $_SDFFCE_NN0P_
chtype -map \$_SDFFCE_NN0N_ $_SDFFCE_NN0N_
chtype -map \$_SDFFCE_NN1P_ $_SDFFCE_NN1P_
chtype -map \$_SDFFCE_NN1N_ $_SDFFCE_NN1N_
rename -top gate
design -stash gate

design -copy-from gold -as gold gold
design -copy-from gate -as gate gate
miter -equiv -flatten -make_assert -make_outputs gold gate miter
sat -prove-asserts -seq 32 -set-init-zero miter
