# Test script to read UHDM file in Yosys
plugin -i ../../build/uhdm2rtlil.so
read_uhdm slpp_all/surelog.uhdm
hierarchy -check -top struct_array
stat
proc
opt
stat
write_rtlil struct_array_from_uhdm.il
# Synthesize to gate-level netlist
synth -top struct_array
write_verilog -noexpr struct_array_from_uhdm_synth.v
