# Test script to read UHDM file in Yosys
plugin -i ../../build/uhdm2rtlil.so
read_uhdm slpp_all/surelog.uhdm
# Write RTLIL immediately after reading, before hierarchy
write_rtlil sp_write_first_from_uhdm_nohier.il
hierarchy -check -top sp_write_first
stat
proc
opt
stat
write_rtlil sp_write_first_from_uhdm.il
# Synthesize to gate-level netlist
synth -top sp_write_first
write_verilog -noexpr sp_write_first_from_uhdm_synth.v
