# Test script to read UHDM file in Yosys
plugin -i ../../build/uhdm2rtlil.so
read_uhdm slpp_all/surelog.uhdm
hierarchy -check -top generate_test
stat
proc
opt
stat
write_rtlil generate_test_from_uhdm.il
# Synthesize to gate-level netlist
synth -top generate_test
write_verilog -noexpr generate_test_from_uhdm_synth.v
