# Test script to read UHDM file in Yosys
plugin -i ../../build/uhdm2rtlil.so
read_uhdm slpp_all/surelog.uhdm
hierarchy -check -top simple_struct
stat
proc
opt
stat
write_rtlil simple_struct_from_uhdm.il
# Synthesize to gate-level netlist
synth -top simple_struct
write_verilog -noexpr simple_struct_from_uhdm_synth.v
