# Test script to read Verilog file directly in Yosys
read_verilog  dut.v
# Write RTLIL immediately after reading, before hierarchy
write_rtlil various_port_sign_extend_from_verilog_nohier.il
hierarchy -check -auto-top
stat
proc
opt
stat
write_rtlil various_port_sign_extend_from_verilog.il
# Synthesize to gate-level netlist
synth -auto-top
write_verilog -noexpr various_port_sign_extend_from_verilog_synth.v
