# Load the design with Verilog frontend
read_verilog -sv dut.sv

# List modules and their types
ls

# Check module types
select \data_bus_if
show -format dot

# Run hierarchy pass
hierarchy -check -top simple_interface

# List modules after hierarchy
ls
