# Test script to read UHDM file in Yosys
plugin -i ../../build/uhdm2rtlil.so
read_uhdm slpp_all/surelog.uhdm
# Write RTLIL immediately after reading, before hierarchy
write_rtlil aes_kexp128_from_uhdm_nohier.il
hierarchy -check -auto-top
stat
proc
opt
stat
write_rtlil aes_kexp128_from_uhdm.il
# Synthesize to gate-level netlist
synth -auto-top
write_verilog -noexpr aes_kexp128_from_uhdm_synth.v
