# Test script to read UHDM file in Yosys
plugin -i ../../build/uhdm2rtlil.so
read_uhdm slpp_all/surelog.uhdm
hierarchy -check -top counter
stat
proc
opt
stat
write_rtlil counter_from_uhdm.il
# Synthesize to gate-level netlist
synth -top counter
write_verilog -noexpr counter_from_uhdm_synth.v
