# Test script to read Verilog file directly in Yosys
read_verilog -sv  ./intfce.sv ./ha_mod.sv ./adders.sv
# Write RTLIL immediately after reading, before hierarchy
write_rtlil iface_method_call_from_verilog_nohier.il
hierarchy -check -auto-top
stat
proc
opt
stat
write_rtlil iface_method_call_from_verilog.il
# Synthesize to gate-level netlist
synth -auto-top
write_verilog -noexpr iface_method_call_from_verilog_synth.v
