# Test script to read Verilog file directly in Yosys
read_verilog -sv  dut.sv
# Write RTLIL immediately after reading, before hierarchy
write_rtlil cs_registers_from_verilog_nohier.il
hierarchy -check -auto-top
stat
proc
opt
stat
write_rtlil cs_registers_from_verilog.il
# Synthesize to gate-level netlist
synth -auto-top
write_verilog -noexpr cs_registers_from_verilog_synth.v
