# Read both synthesized netlists
read_verilog asym_ram_sdp_write_wider_from_verilog_synth.v
prep -top top
design -save gold

design -reset
read_verilog asym_ram_sdp_write_wider_from_uhdm_synth.v
prep -top top

design -save gate
design -copy-from gold -as gold top
design -copy-from gate -as gate top

# Equivalence check
equiv_make gold gate equiv
equiv_simple equiv
equiv_status -assert equiv
