# Test script to read Verilog file directly in Yosys
read_verilog -sv dut.sv
hierarchy -auto-top
stat
proc
opt
stat
write_rtlil adffs_from_verilog.il
# Synthesize to gate-level netlist
synth -auto-top
write_verilog -noexpr adffs_from_verilog_synth.v
