# Test script to read UHDM file in Yosys
plugin -i ../../build/uhdm2rtlil.so
read_uhdm slpp_all/surelog.uhdm
# Write RTLIL immediately after reading, before hierarchy
write_rtlil vector_index_from_uhdm_nohier.il
hierarchy -check -top vector_index
stat
proc
opt
stat
write_rtlil vector_index_from_uhdm.il
# Synthesize to gate-level netlist
synth -top vector_index
write_verilog -noexpr vector_index_from_uhdm_synth.v
