# Test script to read UHDM file in Yosys
plugin -i ../../build/uhdm2rtlil.so
read_uhdm slpp_all/surelog.uhdm
# Write RTLIL immediately after reading, before hierarchy
write_rtlil forloops_from_uhdm_nohier.il
hierarchy -check -top forloops
stat
proc
opt
stat
write_rtlil forloops_from_uhdm.il
# Synthesize to gate-level netlist
synth -top forloops
write_verilog -noexpr forloops_from_uhdm_synth.v
