# Test script to read UHDM file in Yosys
plugin -i /home/alain/uhdm2rtlil/build/uhdm2rtlil.so
read_uhdm slpp_all/surelog.uhdm
hierarchy -auto-top
stat
proc
opt
stat
write_rtlil macc_from_uhdm.il
# Synthesize to gate-level netlist
synth -auto-top
write_verilog -noexpr macc_from_uhdm_synth.v
